Taller de Integracion/app/controllers/purchase_orders_controller.rb

  def create
    @purchase_order = PurchaseOrder.new(purchase_order_params)

    if @purchase_order.save
---
INSERT INTO "purchase_orders" ("orderId", "channel", "supplier", "client", "Sku", "quantity", "dispatchedQuantity", "unitPrice", "state", "billId", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

    def set_purchase_order
      @purchase_order = PurchaseOrder.find(params[:id])
---
SELECT  "purchase_orders".* FROM "purchase_orders" WHERE "purchase_orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]